# Toy employees database (R/MySQL)

In [1]:
# Libraries
library(tidyverse)
library(odbc)
library(DBI)

Warning message:
"package 'ggplot2' was built under R version 4.5.2"
── Attaching core tidyverse packages ──────────────────────── tidyverse 2.0.0 ──
✔ dplyr     1.1.4     ✔ readr     2.1.5
✔ forcats   1.0.0     ✔ stringr   1.5.1
✔ ggplot2   4.0.1     ✔ tibble    3.3.0
✔ lubridate 1.9.4     ✔ tidyr     1.3.1
✔ purrr     1.1.0
── Conflicts ────────────────────────────────────────── tidyverse_conflicts() ──
✖ dplyr::filter() masks stats::filter()
✖ dplyr::lag()    masks stats::lag()
ℹ Use the conflicted package (<http://conflicted.r-lib.org/>) to force all conflicts to become errors
Warning message:
"package 'odbc' was built under R version 4.5.2"
Warning message:
"package 'DBI' was built under R version 4.5.2"

In this notebook, we query a toy schema provided by IBM. The schema has already been created. All therefore need to do is connect to the MySQL database.

We

- connect to an existing MySQL database
- solve some rudimentary query problems

### Cheat sheet

Order of SQL execution:

| order | key word | desc |
| ----- | -------- | ---- |
| 1. | `FROM` | get the table |
| 2. | `WHERE` | filter individual rows |
| 3. | `GROUP BY` | group rows |
| 4. | `HAVING` | filter groups |
| 5. | `SELECT` | choose columns |
| 6. | `ORDER BY` | sort results |

## Check R-MySQL data type conversion

In [2]:
# Data types
menagerie <- c(1, 1L, "1", TRUE, list(raw(1)))

for (animal in menagerie) {
    animal_type <- typeof(animal)

    tryCatch({
        print(
            paste(
                animal_type, ":",
                #dbDataType(RSQLite::SQLite(), animal)
                dbDataType(RMariaDB::MariaDB(), animal)
                #dbDataType(RMySQL::MySQL(), animal)
                #dbDataType(RPostgres::Postgres(), animal)
            )
        )
    }, error = function(e) {
        warning(paste(animal_type, ": unsupported type"))
    })
}

[1] "double : DOUBLE"
[1] "integer : INTEGER"
[1] "character : VARCHAR(1)"
[1] "logical : TINYINT"

Warning message in value[[3L]](cond):
"raw : unsupported type"

## Connection

In [3]:
# List available drivers
odbcListDrivers() |> 
    tibble() |>
    filter(str_detect(name, "SQL"))

   name                          attribute        value
1  SQL Server                    APILevel         2
2  SQL Server                    ConnectFunctions YYY
3  SQL Server                    CPTimeout        60
4  SQL Server                    DriverODBCVer    03.50
5  SQL Server                    FileUsage        0
6  SQL Server                    SQLLevel         1
7  SQL Server                    UsageCount       1
8  MySQL ODBC 9.6 ANSI Driver    UsageCount       1
9  MySQL ODBC 9.6 Unicode Driver UsageCount       1
10 PostgreSQL ANSI(x64)          UsageCount       1
11 PostgreSQL ANSI(x64)          CPTimeout        60
12 PostgreSQL ANSI(x64)          APILevel         1
13 PostgreSQL ANSI(x64)          ConnectFunctions YYN
14 PostgreSQL ANSI(x64)          DriverODBCVer    03.51
15 PostgreSQL ANSI(x64)          FileUsage        0
16 PostgreSQL ANSI(x64)          SQLLevel         1
17 PostgreSQL ANSI               UsageCount       1
18 PostgreSQL ANSI               CPTimeout        60
19 PostgreSQL ANSI               APILevel         1
20 PostgreSQL ANSI               ConnectFunctions YYN
21 PostgreSQL ANSI               DriverODBCVer    03.51
22 PostgreSQL ANSI               FileUsage        0
23 PostgreSQL ANSI               SQLLevel         1
24 PostgreSQL Unicode(x64)       UsageCount       1
25 PostgreSQL Unicode(x64)       CPTimeout        60
26 PostgreSQL Unicode(x64)       APILevel         1
27 PostgreSQL Unicode(x64)       ConnectFunctions YYN
28 PostgreSQL Unicode(x64)       DriverODBCVer    03.51
29 PostgreSQL Unicode(x64)       FileUsage        0
30 PostgreSQL Unicode(x64)       SQLLevel         1
31 PostgreSQL Unicode            UsageCount       1
32 PostgreSQL Unicode            CPTimeout        60
33 PostgreSQL Unicode            APILevel         1
34 PostgreSQL Unicode            ConnectFunctions YYN
35 PostgreSQL Unicode            DriverODBCVer    03.51
36 PostgreSQL Unicode            FileUsage        0
37 PostgreSQL Unicode            SQLLevel         1

In [4]:

# Establish connection
c <- dbConnect(
	drv = odbc(),
	driver = "MySQL ODBC 9.6 Unicode Driver", # MySQL, PostgreSQL, SQLite3
	database = "mysql", # MySQL mysql, PostgreSQL postgres, SQLite :memory:
	server = "localhost",
	uid = "r_user",
	pwd = "sql_r",
	port = 3306 # MySQL 3306, PostgreSQL 5432, SQLite 5432, SQL Server 1433
)

In [5]:
# Display databases
#c |> dbGetQuery("SHOW DATABASES;")

In [6]:
# Select database
c |> dbGetQuery("USE ibm_employees_02;")

In [7]:
# Display available tables
q <- "
SHOW TABLES;
"
dbGetQuery(c, q)

  Tables_in_ibm_employees_02
1 departments
2 employees
3 job_history
4 jobs
5 locations

## String patterns, sorting, grouping

In [15]:
# List the first name, last name, and birth date of all employees who were born before January 1, 1980
q <- "
SELECT f_name, l_name, b_date FROM employees
WHERE YEAR(b_date) < 1980;
"
dbGetQuery(c, q)

  f_name l_name b_date
1 John   Thomas 1976-09-01
2 Alice  James  1972-07-31
3 Nancy  Allen  1978-06-02
4 Mary   Thomas 1975-05-05

In [14]:
# Retrieve the first name, last name, and birth date of all employees who were born between January 1, 1980 and December 31, 1989 (inclusive)
q <- "
SELECT f_name, l_name, b_date FROM employees
WHERE b_date BETWEEN DATE('1980-01-01') AND DATE('1989-12-31');
"
dbGetQuery(c, q)

  f_name  l_name  b_date
1 Steve   Wells   1980-10-08
2 Santosh Kumar   1985-07-20
3 Ahmed   Hussain 1981-04-01
4 Bharath Gupta   1985-06-05
5 Ann     Jacob   1982-03-30

In [17]:
# Find the first and last names of all employees whose first name ends with the letter y
q <- "
SELECT f_name, l_name FROM employees
WHERE f_name LIKE '%y';
"
dbGetQuery(c, q)

  f_name l_name
1 Nancy  Allen
2 Mary   Thomas

In [19]:
# Display the last name and department ID of all employees who work in department 2 or department 7
q <- "
SELECT l_name, dep_id FROM employees
WHERE dep_id IN (2, 7);
"
dbGetQuery(c, q)

  l_name  dep_id
1 Thomas  2
2 Hussain 2
3 Allen   2
4 Thomas  7
5 Gupta   7
6 Jones   7

In [20]:
# Return all columns for all employees, ordered by birth date from oldest to youngest
q <- "
SELECT * FROM employees
ORDER BY b_date DESC;
"
dbGetQuery(c, q)

   EMP_ID F_NAME  L_NAME  SSN    B_DATE     SEX ADDRESS
1  E1009  Andrea  Jones   123414 1990-09-07 F   120 Fall Creek, Gary,IL
2  E1004  Santosh Kumar   123459 1985-07-20 M   511 Aurora Av, Aurora,IL
3  E1008  Bharath Gupta   123413 1985-06-05 M   145 Berry Ln, Naperville,IL
4  E1010  Ann     Jacob   123415 1982-03-30 F   111 Britany Springs,Elgin,IL
5  E1005  Ahmed   Hussain 123410 1981-04-01 M   216 Oak Tree, Geneva,IL
6  E1003  Steve   Wells   123458 1980-10-08 M   291 Springs, Gary,IL
7  E1006  Nancy   Allen   123411 1978-06-02 F   111 Green Pl, Elgin,IL
8  E1001  John    Thomas  123456 1976-09-01 M   5631 Rice, OakPark,IL
9  E1007  Mary    Thomas  123412 1975-05-05 F   100 Rose Pl, Gary,IL
10 E1002  Alice   James   123457 1972-07-31 F   980 Berry ln, Elgin,IL
   JOB_ID SALARY MANAGER_ID DEP_ID
1  234     70000 30003      7
2  400     60000 30002      5
3  660     65000 30003      7
4  220     70000 30002      5
5  500     70000 30001      2
6  300     50000 30002      5
7  600     90000 30001      2
8  100    100000 30001      2
9  650     65000 30003      7
10 200     80000 30002      5

In [21]:
# Return all employee records ordered by salary from highest to lowest
q <- "
SELECT * FROM employees
ORDER BY salary DESC;
"
dbGetQuery(c, q)

   EMP_ID F_NAME  L_NAME  SSN    B_DATE     SEX ADDRESS
1  E1001  John    Thomas  123456 1976-09-01 M   5631 Rice, OakPark,IL
2  E1006  Nancy   Allen   123411 1978-06-02 F   111 Green Pl, Elgin,IL
3  E1002  Alice   James   123457 1972-07-31 F   980 Berry ln, Elgin,IL
4  E1005  Ahmed   Hussain 123410 1981-04-01 M   216 Oak Tree, Geneva,IL
5  E1009  Andrea  Jones   123414 1990-09-07 F   120 Fall Creek, Gary,IL
6  E1010  Ann     Jacob   123415 1982-03-30 F   111 Britany Springs,Elgin,IL
7  E1007  Mary    Thomas  123412 1975-05-05 F   100 Rose Pl, Gary,IL
8  E1008  Bharath Gupta   123413 1985-06-05 M   145 Berry Ln, Naperville,IL
9  E1004  Santosh Kumar   123459 1985-07-20 M   511 Aurora Av, Aurora,IL
10 E1003  Steve   Wells   123458 1980-10-08 M   291 Springs, Gary,IL
   JOB_ID SALARY MANAGER_ID DEP_ID
1  100    100000 30001      2
2  600     90000 30001      2
3  200     80000 30002      5
4  500     70000 30001      2
5  234     70000 30003      7
6  220     70000 30002      5
7  650     65000 30003      7
8  660     65000 30003      7
9  400     60000 30002      5
10 300     50000 30002      5

In [24]:
# For each department and each sex category within that department, count how many employees belong to each group
q <- "
SELECT dep_id, sex, COUNT(*) AS count FROM employees
GROUP BY dep_id, sex
ORDER BY dep_id, sex;
"
dbGetQuery(c, q)

  dep_id sex count
1 2      F   1
2 2      M   2
3 5      F   2
4 5      M   2
5 7      F   2
6 7      M   1

In [29]:
# From the department-sex groupings, show only those combinations where fewer than 2 employees exist in that department for that sex
q <- "
SELECT dep_id, sex, COUNT(*) AS count FROM employees
GROUP BY dep_id, sex
HAVING count < 2
ORDER BY dep_id, sex;
"
dbGetQuery(c, q)

  dep_id sex count
1 2      F   1
2 7      M   1

In [31]:
# Retrieve all employee records where the address contains the word Elgin
q <- "
SELECT * FROM employees
WHERE address LIKE '%Elgin%';
"
dbGetQuery(c, q)

  EMP_ID F_NAME L_NAME SSN    B_DATE     SEX ADDRESS
1 E1002  Alice  James  123457 1972-07-31 F   980 Berry ln, Elgin,IL
2 E1006  Nancy  Allen  123411 1978-06-02 F   111 Green Pl, Elgin,IL
3 E1010  Ann    Jacob  123415 1982-03-30 F   111 Britany Springs,Elgin,IL
  JOB_ID SALARY MANAGER_ID DEP_ID
1 200    80000  30002      5
2 600    90000  30001      2
3 220    70000  30002      5

In [34]:
# List all employees born between January 1, 1970 and December 31, 1979 (inclusive)
q <- "
SELECT f_name, l_name, b_date FROM employees
WHERE b_date BETWEEN DATE('1970-01-01') AND DATE('1979-12-21')
ORDER BY b_date;
"
dbGetQuery(c, q)

  f_name l_name b_date
1 Alice  James  1972-07-31
2 Mary   Thomas 1975-05-05
3 John   Thomas 1976-09-01
4 Nancy  Allen  1978-06-02

In [35]:
# Retrieve all employees who work in department 5, and earn a salary between 60,000 and 69,999 (inclusive)
q <- "
SELECT * FROM employees
WHERE dep_id = 5 AND salary BETWEEN 60000 AND 69999;
"
dbGetQuery(c, q)

  EMP_ID F_NAME  L_NAME SSN    B_DATE     SEX ADDRESS                  JOB_ID
1 E1004  Santosh Kumar  123459 1985-07-20 M   511 Aurora Av, Aurora,IL 400
  SALARY MANAGER_ID DEP_ID
1 60000  30002      5

In [ ]:
# Display all employees ordered by department ID in ascending order
q <- "
SELECT * FROM employees
ORDER BY dep_id ASC;
"
dbGetQuery(c, q)

   EMP_ID F_NAME  L_NAME  SSN    B_DATE     SEX ADDRESS
1  E1001  John    Thomas  123456 1976-09-01 M   5631 Rice, OakPark,IL
2  E1005  Ahmed   Hussain 123410 1981-04-01 M   216 Oak Tree, Geneva,IL
3  E1006  Nancy   Allen   123411 1978-06-02 F   111 Green Pl, Elgin,IL
4  E1002  Alice   James   123457 1972-07-31 F   980 Berry ln, Elgin,IL
5  E1003  Steve   Wells   123458 1980-10-08 M   291 Springs, Gary,IL
6  E1004  Santosh Kumar   123459 1985-07-20 M   511 Aurora Av, Aurora,IL
7  E1010  Ann     Jacob   123415 1982-03-30 F   111 Britany Springs,Elgin,IL
8  E1007  Mary    Thomas  123412 1975-05-05 F   100 Rose Pl, Gary,IL
9  E1008  Bharath Gupta   123413 1985-06-05 M   145 Berry Ln, Naperville,IL
10 E1009  Andrea  Jones   123414 1990-09-07 F   120 Fall Creek, Gary,IL
   JOB_ID SALARY MANAGER_ID DEP_ID
1  100    100000 30001      2
2  500     70000 30001      2
3  600     90000 30001      2
4  200     80000 30002      5
5  300     50000 30002      5
6  400     60000 30002      5
7  220     70000 30002      5
8  650     65000 30003      7
9  660     65000 30003      7
10 234     70000 30003      7

In [39]:
# Display all employees ordered first by department ID in descending order then alphabetically by last name in ascending order within each department
q <- "
SELECT * FROM employees
ORDER BY dep_id DESC, l_name ASC;
"
dbGetQuery(c, q)

   EMP_ID F_NAME  L_NAME  SSN    B_DATE     SEX ADDRESS
1  E1008  Bharath Gupta   123413 1985-06-05 M   145 Berry Ln, Naperville,IL
2  E1009  Andrea  Jones   123414 1990-09-07 F   120 Fall Creek, Gary,IL
3  E1007  Mary    Thomas  123412 1975-05-05 F   100 Rose Pl, Gary,IL
4  E1010  Ann     Jacob   123415 1982-03-30 F   111 Britany Springs,Elgin,IL
5  E1002  Alice   James   123457 1972-07-31 F   980 Berry ln, Elgin,IL
6  E1004  Santosh Kumar   123459 1985-07-20 M   511 Aurora Av, Aurora,IL
7  E1003  Steve   Wells   123458 1980-10-08 M   291 Springs, Gary,IL
8  E1006  Nancy   Allen   123411 1978-06-02 F   111 Green Pl, Elgin,IL
9  E1005  Ahmed   Hussain 123410 1981-04-01 M   216 Oak Tree, Geneva,IL
10 E1001  John    Thomas  123456 1976-09-01 M   5631 Rice, OakPark,IL
   JOB_ID SALARY MANAGER_ID DEP_ID
1  660     65000 30003      7
2  234     70000 30003      7
3  650     65000 30003      7
4  220     70000 30002      5
5  200     80000 30002      5
6  400     60000 30002      5
7  300     50000 30002      5
8  600     90000 30001      2
9  500     70000 30001      2
10 100    100000 30001      2

In [40]:
# Display all information from the departments table
q <- "
SELECT * FROM departments;
"
dbGetQuery(c, q)

  DEPT_ID_DEP DEP_NAME        MANAGER_ID LOC_ID
1 2           Architect Group 30001      L0001
2 5           Software Group  30002      L0002
3 7           Design Team     30003      L0003

In [44]:
# List all employee details along with their department names. Sort the results first alphabetically by department name (A–Z), then by last name in descending order within each department
q <- "
SELECT e.*, d.dep_name
FROM employees AS e, departments AS d
WHERE e.dep_id = d.dept_id_dep
ORDER BY dep_name ASC, l_name DESC;
"
dbGetQuery(c, q)

   EMP_ID F_NAME  L_NAME  SSN    B_DATE     SEX ADDRESS
1  E1001  John    Thomas  123456 1976-09-01 M   5631 Rice, OakPark,IL
2  E1005  Ahmed   Hussain 123410 1981-04-01 M   216 Oak Tree, Geneva,IL
3  E1006  Nancy   Allen   123411 1978-06-02 F   111 Green Pl, Elgin,IL
4  E1007  Mary    Thomas  123412 1975-05-05 F   100 Rose Pl, Gary,IL
5  E1009  Andrea  Jones   123414 1990-09-07 F   120 Fall Creek, Gary,IL
6  E1008  Bharath Gupta   123413 1985-06-05 M   145 Berry Ln, Naperville,IL
7  E1003  Steve   Wells   123458 1980-10-08 M   291 Springs, Gary,IL
8  E1004  Santosh Kumar   123459 1985-07-20 M   511 Aurora Av, Aurora,IL
9  E1002  Alice   James   123457 1972-07-31 F   980 Berry ln, Elgin,IL
10 E1010  Ann     Jacob   123415 1982-03-30 F   111 Britany Springs,Elgin,IL
   JOB_ID SALARY MANAGER_ID DEP_ID dep_name
1  100    100000 30001      2      Architect Group
2  500     70000 30001      2      Architect Group
3  600     90000 30001      2      Architect Group
4  650     65000 30003      7      Design Team
5  234     70000 30003      7      Design Team
6  660     65000 30003      7      Design Team
7  300     50000 30002      5      Software Group
8  400     60000 30002      5      Software Group
9  200     80000 30002      5      Software Group
10 220     70000 30002      5      Software Group

In [50]:
# For each department, calculate the total number of employees assigned to it
q <- "
SELECT d.dep_name, COUNT(*) AS emp_count
FROM employees AS e, departments AS d
WHERE e.dep_id = d.dept_id_dep
GROUP BY dep_name;
"
dbGetQuery(c, q)

  dep_name        emp_count
1 Architect Group 3
2 Software Group  4
3 Design Team     3

In [ ]:
# For each department, display the department ID, the department name, the number of employees in that department
q <- "

"
dbGetQuery(c, q)

In [ ]:
# 
q <- "

"
dbGetQuery(c, q)

## Functions

In [ ]:
# 
q <- "

"
dbGetQuery(c, q)

## Disconnect

In [9]:
# Disconnect
#dbDisconnect(c)